name: "CIFAR10_data"
layer {
  name: "cifar"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_file: "experiment/cifar10/mean.binaryproto"
  }
  data_param {
    source: "experiment/cifar10/cifar10_train_lmdb"
    batch_size: 25
    backend: LMDB
  }
}
